<template>
    <div class="privacy-text">
        <p>Здесь будет располагаться официальный текст согласия на обработку персональных данных...</p>
        <p>1. Общие положения...</p>
        <p>2. Цели обработки...</p>
        <p>3. Права пользователя...</p>
        <p>4. Купил мужик шляпу, а она ему как раз...</p>
        <p>5. Идёт медведь по лесу, видит - машина горит. Сел в неё. И сгорел...</p>
        <p>6. Идёт Штирлиц по улице, тут ему на голову упал кирпич. "Вот те раз..." - подумал Штирлиц. "Вот те два!" - подумал Мюллер и скинул второй кирпич... </p>
        <p>7. Заходит улитка в бар... а нет нельзя, дальше маты...</p>
    </div>
</template>

<style scoped>
.privacy-text {
    font-family: var(--font-text);
    color: var(--color-font);
    line-height: 1.6;
}
.privacy-text p {
    margin-bottom: 15px;
}
</style>